Revit 2027 API
DisciplineTypeId Properties
The DisciplineTypeId type exposes the following members.
Properties
Name | Description
Architecture |  Architecture.
Common |  Common.
Electrical |  Electrical.
Energy |  Energy.
Hvac |  HVAC.
Infrastructure |  Infrastructure.
Piping |  Piping.
Structural |  Structural.
Top
See Also
Reference
DisciplineTypeId Class
Autodesk.Revit.DB Namespace